{
    "table_name": "foitext2018",
    "structure": [
        {
            "name": "mdr_report_key",
            "type": "TEXT",
            "nullable": true,
            "default": null
        },
        {
            "name": "mdr_text_key",
            "type": "TEXT",
            "nullable": true,
            "default": null
        },
        {
            "name": "text_type_code",
            "type": "TEXT",
            "nullable": true,
            "default": null
        },
        {
            "name": "patient_sequence_number",
            "type": "TEXT",
            "nullable": true,
            "default": null
        },
        {
            "name": "date_report",
            "type": "TEXT",
            "nullable": true,
            "default": null
        },
        {
            "name": "foi_text",
            "type": "TEXT",
            "nullable": true,
            "default": null
        }
    ],
    "sample_data": [
        {
            "mdr_report_key": "5866367",
            "mdr_text_key": "51790838",
            "text_type_code": "N",
            "patient_sequence_number": "1",
            "date_report": null,
            "foi_text": "THIS DEVICE IS USED FOR TREATMENT NOT DIAGNOSIS. THE VENTRICULAR ASSIST SYSTEM IS INDICATED FOR USE AS A BRIDGE TO CARDIAC TRANSPLANTATION IN PATIENTS WHO ARE AT RISK OF DEATH FROM REFRACTORY END-STAGE LEFT VENTRICULAR HEART FAILURE. THE SYSTEM IS DESIGNED FOR IN-HOSPITAL AND OUT-OF-HOSPITAL SETTINGS. LOG FILE ANALYSIS REVEALED 26 HIGH WATT ALARMS STARTING ON (B)(6) 2016, CONFIRMING THE REPORTED EVENT. A RISE IN POWER CONSUMPTION BEGAN ON (B)(6) 2016 TO A PEAK OF 17.1 WATTS, OUTSIDE THE NORMAL OPERATING RANGE. WAVEFORMS OF THIS NATURE MAY BE INDICATIVE OF THROMBUS OR A CHANGE IN PATIENT STATE. THE INSTRUCTIONS FOR USE (IFU) STATES: THE LVAD SYSTEM IS INDICATED FOR USE AS A BRIDGE TO CARDIAC TRANSPLANTATION IN PATIENTS WHO ARE AT RISK OF DEATH FROM REFRACTORY END-STAGE HEART FAILURE. IMPLANTATION OF A VENTRICULAR ASSIST DEVICE (VAD) IS AN INVASIVE PROCEDURE REQUIRING GENERAL ANESTHESIA, A MEDIAN STERNOTOMY, A VENTILATOR AND CARDIOPULMONARY BYPASS. THESE SURGICAL PROCEDURES ARE ASSOCIATED WITH NUMEROUS RISKS AND ADVERSE EVENTS INCLUDING DEATH. AS STATED IN IFU, THAT RIGHT HEART FAILURE IS COMMON IN PATIENTS RECEIVING LVADS. ALSO THAT THE ETIOLOGY OF LATE RIGHT HEART FAILURE MAY BE A PROGRESSION OF CHRONIC HEART DISEASE. HVAD PUMP (B)(4) WAS NOT RETURNED TO HEARTWARE FOR EVALUATION. REVIEW OF THE MANUFACTURING RECORDS CONFIRMED THAT THE ASSOCIATED DEVICE MET ALL REQUIREMENTS FOR RELEASE. THE REPORTED EVENT WAS CONFIRMED VIA REVIEW OF THE CONTROLLER LOG FILES WHICH REVEALED THE REPORTED HIGH WATT ALARMS AND A RISE IN POWER CONSUMPTION TO PARAMETERS OUTSIDE THE NORMAL OPERATING RANGE. A REPORT PROVIDED BY THE SITE NOTED THAT A SIGNIFICANT 3RD HARMONY CONFIRMED THE SUSPECTED PUMP THROMBUS. VISUAL INSPECTION OF THE DEVICE BY THE SITE REVEALED SCORING MARKS ON THE INFERIOR SURFACE OF THE IMPELLER AS WELL AS THE PRESENCE OF THROMBUS ON THE IMPELLER AND INFLOW CANNULA. THESE FRICTION MARKS ARE INDICATIVE THAT AN EXTERNAL FACTOR SUCH AS THROMBUS MAY HAVE FORCED THE IMPELLER AGAINST THE REAR HOUSING WITH SUFFICIENT STRENGTH TO OVERCOME THE REAR PRELOAD OF THE MAGNETIC SPRING/SUSPENSION SYSTEM. AS SUCH, THE PRESENCE OF FRICTION MARKS IS LIKELY A SYMPTOM OF THE CLINICAL CHALLENGE THE PUMP HAS EXPERIENCED AND IS GENERALLY NOT EVIDENCE OF A PUMP INDUCED PROBLEM. THERE IS NO EVIDENCE TO SUGGEST THAT A DEVICE MALFUNCTION CAUSED OR CONTRIBUTED TO THE REPORTED EVENT. THE MOST LIKELY ROOT CAUSE OF THE HIGH POWER EVENT CAN BE ATTRIBUTED TO EXTERNAL FACTORS SUCH AS THROMBUS FORMATION. THE MANUFACTURER WILL SUBMIT A SUPPLEMENTAL REPORT WHEN NEW FACTS ARISE WHICH MATERIALLY ALTER INFORMATION SUBMITTED IN A PREVIOUS MDR REPORT."
        },
        {
            "mdr_report_key": "5866367",
            "mdr_text_key": "51790839",
            "text_type_code": "D",
            "patient_sequence_number": "1",
            "date_report": null,
            "foi_text": "IT WAS REPORTED THAT THE PATIENT HIGH WATT ALARMS. THE PATIENT PASSED AWAY. CAUSE AND DATE OF DEATH ARE UNKNOWN AT THIS TIME. THE SITE WAS UNABLE TO MAKE A CAUSAL RELATIONSHIP BETWEEN THE DEVICE AND THE EVENT. A THROMBUS WAS VISUALLY DETECTED AND IT WAS REPORTED THAT THE PUMP WAS MAKING ABNORMAL GRINDING NOISES. PATIENT WAS ON AN UNKNOWN ANTICOAGULATION MEDICATION AND HIS INR WAS 62. PATIENT'S HEMATOCRIT SETTINGS ON THE CONTROLLER WERE CORRECT. PATIENT DID HAVE ELEVATED HGB AND LDH. NO ADDITIONAL INFORMATION AVAILABLE."
        },
        {
            "mdr_report_key": "5866367",
            "mdr_text_key": "53709500",
            "text_type_code": "N",
            "patient_sequence_number": "1",
            "date_report": null,
            "foi_text": "CORRECTION: THE PATIENT PRO THROMBIA TIME WAS 62 INSTEAD OF THE INR. HEARTWARE WILL SUBMIT A SUPPLEMENTAL REPORT WHEN NEW FACTS ARISES WHICH MATERIALLY ALTERS INFORMATION SUBMITTED IN A PREVIOUS MDR REPORT."
        }
    ]
}