{
    "table_name": "foitext2012",
    "structure": [
        {
            "name": "mdr_report_key",
            "type": "TEXT",
            "nullable": true,
            "default": null
        },
        {
            "name": "mdr_text_key",
            "type": "TEXT",
            "nullable": true,
            "default": null
        },
        {
            "name": "text_type_code",
            "type": "TEXT",
            "nullable": true,
            "default": null
        },
        {
            "name": "patient_sequence_number",
            "type": "TEXT",
            "nullable": true,
            "default": null
        },
        {
            "name": "date_report",
            "type": "TEXT",
            "nullable": true,
            "default": null
        },
        {
            "name": "foi_text",
            "type": "TEXT",
            "nullable": true,
            "default": null
        }
    ],
    "sample_data": [
        {
            "mdr_report_key": "1047600",
            "mdr_text_key": "867234",
            "text_type_code": "D",
            "patient_sequence_number": "1",
            "date_report": null,
            "foi_text": "THE LAY USER/REPORTER CONTACTED LIFESCAN ALLEGING THAT THE PRODUCT WAS HAVING THE FOLLOWING ISSUE: THE SHIPPING CARTON, BOX OF METER AND MANUAL WERE WET, METER WAS WITHIN RANGE WHEN RAN THROUGH A CONTROL SOLUTION. THERE WERE NO ALLEGATIONS OF HARM OR INJURY."
        },
        {
            "mdr_report_key": "2255179",
            "mdr_text_key": "2158381",
            "text_type_code": "D",
            "patient_sequence_number": "1",
            "date_report": null,
            "foi_text": "IRREVERSIBLE PERMANENT NERVE DAMAGE [NERVE INJURY]. DIFFUSE SEVERE PERIPHERAL POLYNEUROPATHY [POLYNEUROPATHY]. UNSTEADY GAIT, ANTALGIC GAIT [GAIT DISTURBANCE]. IMBALANCE, LOSES BALANCE [BALANCE DISORDER]. NUMBNESS OF BOTH FEET, DECREASED FEELING IN OF THE FEET OF THE LANTAR ASPECTS [HYPOAESTHESIA]. TINGLING OF BOTH FEET [PARAESTHESIA]. FREQUENT FALLS [FALL]. HYPOESTHESIA TO PINPRICK AND LIGHT TOUCH IN HIGH STOCKINGS DISTRIBUTION IN BOTH LOWER EXTREMITIES [HYPOAESTHESIA]. DECREASED VIBRATORY SENSATION OF DISTAL PART OF BOTH FEET [DECREASED VIBRATORY SENSE]. GAIT IS ATAXIC AND AMBULATES WITH A CANE [ATAXIA]. PERIPHERAL NEUROPATHY [NEUROPATHY PERIPHERAL]. WEAKNESS OF MUSCULATURE OF LOWER EXTREMITIES [MUSCULAR WEAKNESS]. CENTRAL AND PERIPHERAL VESTIBULAR DYSFUNCTION [VESTIBULAR DISORDER]. PAIN IN BOTH FEET [PAIN IN EXTREMITY]. NUMBNESS IN BOTH HANDS [HYPOAESTHESIA]. TINGLING IN BOTH HANDS, PARESTHESIAS [PARAESTHESIA]. WEAKNESS IN BOTH HANDS [MUSCULAR WEAKNESS]. BILATERAL CARPAL TUNNEL SYNDROME [CARPAL TUNNEL SYNDROME]. ULNAR NERVE NEUROPATHY AT THE WRIST [PERIPHERAL NERVE LESION]. ZINC TOXICITY [METAL POISONING]. BLOOD ZINC INCREASED [BLOOD ZINC INCREASED]. DEEP TENDON REFLEXES ABNORMAL [HYPOREFLEXIA]. JOINT RANGE OF MOTION DECREASED [JOINT RANGE OF MOTION DECREASED]. CASE DESCRIPTION: A CONSUMER, REPRESENTING PRO SE AT THIS TIME, REPORTED THAT THEY, AN ELDERLY MALE NOW AGE (B)(6), USED FIXODENT DENTURE ADHESIVE, VERSION UNK CREAM ALTERNATELY WITH POLIGRIP DENTURE ADHESIVE CREAM FOR AS LONG AS HE CAN REMEMBER, UNSPECIFIED TOTAL DAILY USE ON DENTURES HE HAS BEEN WEARING FOR MORE THAN 30 YEARS, AND REPORTED THE FOLLOWING: EXTREMELY HIGH LEVEL OF ZINC IN HIS BODY (365 WHEREAS THE NORMAL RANGE IS 60-120) THAT HAS ADVERSELY AFFECTED HIS HEALTH, IS CURRENTLY EXPERIENCING PAIN AND SUFFERING FROM NEUROPATHY MANIFESTING ALL THE CLASSIC BODY DYSFUNCTIONS AND AILMENTS, IS ENDURING AND WILL CONTINUE TO ENDURE NERVE DAMAGE THAT IS IRREVERSIBLE AND PERMANENT. THE CONSUMER HAS RECEIVED AND WILL CONTINUE TO RECEIVE UNSPECIFIED MEDICAL CARE AND TREATMENT BY HIS NEUROLOGIST, MEDICAL INTERNIST, PSYCHIATRIST, AND PHYSICAL THERAPISTS. PAST MEDICAL HISTORY INCLUDED: MEDIAL HISTORY - DENTURE WEARER FOR MORE THAN 30 YEARS. NO FURTHER INFO WAS PROVIDED. SYNOPSIS OF RELEVANT MEDICAL AND DOCTORS' RECORDS BY CONSUMER AS FOLLOWS: ON (B)(6) 2009, COMPUTERIZED MUSCLE TESTING (CMT) AND RANGE OF MOTION (ROM) USING JTECK TRACKER ROM WAS COMPLETED ON RIGHT UPPER AND LEFT UPPER EXTREMITIES. FINAL IMPAIRMENT RESULTS AS FOLLOWS; WHOLE PERSON (WP) LEFT UPPER EXTREMITY IMPAIRMENT: 7%. WHOLE PERSON (WP) RIGHT UPPER EXTREMITY IMPAIRMENT: 8% WITH FINAL WHOLE PERSON IMPAIRMENT: 14%. ON (B)(6) 2010, A MALE WITH DATE OF BIRTH OF (B)(6), PRESENTED TO A PHYSICIAN OFFICE FOR AN INITIAL NEUROLOGICAL EVAL CONSULTATION WITH CHIEF COMPLAINTS OF INSTEADY GAIT AND IMBALANCE. THE PT REPORTED THE SYMPTOMS STARTED SEVERAL YEARS AGO WITHOUT TRIGGERING EVENTS AND HAS PROGRESSIVELY WORSENED. THE PT HAS BEEN SEEN BY HIS PRIMARY CARE PHYSICIAN AND WAS REFERRED FOR CONSULTATION AND PHYSICAL THERAPY. CURRENT SYMPTOMS INCLUDE NUMBNESS AND TINGLING IN BOTH FEET THAT IS INTERMITTENT AND ACCOMPANIED BY PERSISTENTLY UNSTEADY GAIT, IMBALANCE AND FREQUENT FALLS. THE PT DENIES ANY DIZZINESS. MEDICATIONS INCLUDES: TOPROL, LOVASTATIN, LISINOPRIL, AMLODIPINE, METFORMIN, GLYBURIDE AND BABY ASPIRIN DAILY. NO KNOWN DRUG ALLERGIES ARE REPORTED. PAST MEDICAL HISTORY IS SIGNIFICANT FOR HYPERTENSION, DIABETES, HYPERCHOLESTEROLEMIA, CORONARY ARTERY DISEASE, DENIES SMOKING. SURGICAL HISTORY IS SIGNIFICANT FOR STATUS POST CABG WITH FOUR BLOOD VESSEL REPLACEMENT, STATUS POST CHOLECYSTECTOMY AND STATUS POST SACRAL FUSION. NEUROLOGICAL EXAMINATION: COGNITIVE: ALERT, AWAKE, ORIENTED TO PERSON, PLACE AND THING. CRANIAL NERVES: NO ABNORMALITIES DETECTED. CEREBELLUM: FINGER NOSE FINGER TEST IS NORMAL BILATERALLY. MUSCLE BULK AND TONE ARE NORMAL IN THE MAJOR MUSCLE GROUP OF ALL FOUR EXTREMITIES. MUSCLE STRENGTH EVAL FOR MOTOR DISTRIBUTION REVEALED MUSCLES TESTING ABNORMAL (FOOT EVERSION (S1), FOOT INVERSION (L4), EXTENSOR HALLUCIS LONGUS, HAMSTRINGS, TIBIALIS ANTERIOR). DEEP TENDON REFLEXES ABNORMAL (ACHILLES, HAMSTRINGS AND PATELLAR REFLEXES). ALL SENSORY DERMATOMES NORMAL TO LIGHT TOUCH AND PINPRICK EXCEPT FOR HYPOESTHESIA TO PINPRICK AND LIGHT TOUCH IN HIGH STOCKING DISTRIBUTION IN BOTH TOWER EXTREMITIES AND DECREASED VIBRATORY SENSATION IN THE DISTAL OF BOTH FEET. GAIT IS ATAXIC AND UNSTEADY. ROMBERG IS MILDLY POSITIVE. IMPRESSION: PERIPHERAL NEUROPATHY AND UNSTEADY GAIT. ON (B)(6) 2010, PT PRESENTED TO PHYSICIAN OFFICE FOR EVAL OF AN IMBALANCE PROBLEM. THE PT HAS A HISTORY OF AN AUTOMOBILE ACCIDENT IN (B)(6) 2008, WITH SUBSEQUENT BACK SURGERY WITH RETAINED HARDWARE WITHIN THE BACK. PT BALANCE PROBLEMS HAS EXACERBATED SINCE BACK SURGERY. PT FALLS CONSTANTLY, LOSES HIS BALANCE AND SOMETIMES USES A CANE. PAST MEDICAL HISTORY: QUADRUPLE BYPASS STATUS POST AVANDIA AND IS A DIABETIC. PHYSICAL EXAM SHOWED SIGNIFICANT WEAKNESS OF MUSCULATURE OF THE LOWER EXTREMITIES ESPECIALLY OVER THE CALF WITH DECREASED FEELING IN BOTH FEET OF THE PLANTAR ASPECTS. GAIT EVAL REVEALED SIGNIFICANT GAIT ABNORMALITY AND ANTALGIC TYPE GAIT WITH IMBALANCE. ASSESSMENT: IMBALANCE PROBLEM WITH GAIT ABNORMALITIES. PLAN: RECOMMENDATION OF BILATERAL ANKLE AND FOOT ORTHOSIS AND GAIT ANALYSIS. ON (B)(6) 2011, LOWER EMG AND NERVE CONDUCTION STUDY CONDUCTED TO RULE OUT PERIPHERAL NEUROPATHY. CHIEF COMPLAINT: PT PRESENTS WITH UNSTEADY GAIT, IMBALANCE AND TINGLING IN LOWER EXTREMITIES WITH HAVE BEEN PRESENT FOR SEVERAL YEARS AND HAVE BEEN PROGRESSING FOR 4 MONTHS. FINDINGS: ABNORMAL. IMPRESSIONS: ELECTROPHYSIOLOGIC EVIDENCE OF A DIFFUSE MODERATELY SEVERE SENSORIMOTOR AXONAL AND DEMYELINATING PERIPHERAL POLYNEUROPATHY PREDOMINANTLY AFFECTING BOTH LOWER EXTREMITIES. ON (B)(6) 2010, VIDEONYSTAGMOGRAPHY CONDUCTED WITH IMPRESSION OF EVIDENCE OF CENTRAL AND PERIPHERAL VESTIBULAR DYSFUNCTION. ON (B)(6) 2011, PT PRESENTED TO PHYSICIAN OFFICE FOR F/U VISIT AN IMBALANCE PROBLEM AND CONTINUED CARE OF PERIPHERAL NEUROPATHY BILATERALLY. THE PT HAS DIABETES THEREFORE HE HAS DIABETIC NEUROPATHY. HE HAS CONSTANT TINGLING AND PAIN IN BOTH HIS FEET, PROBLEMS WALKING ESPECIALLY UP AND DOWNSTAIRS. GAIT EXAMINATION REVEALED PRONATORY TENDENCIES AND BILATERAL MEDIAL INSTABILITY OF BOTH ARCHES. PLAN: DIABETIC SHOES WITH INSERTS TO ACCOMMODATE PERIPHERAL NEUROPATHY WITH PRONATION HAVE BEEN ORDERED. PHYSICAL THERAPY AND CONTINUATION OF ANODYNE THERAPY. ON (B)(6) 2011, PT PRESENTED TO PHYSICIAN OFFICE FOR F/U VISIT AN IMBALANCE PROBLEM AND WHERE THE PT RECEIVED HIS ORTHOPEDIC INSOLES AND DIABETIC SHOES. ON (B)(6) 2011, PT PRESENTED TO PHYSICIAN OFFICE FOR F/U VISIT AN IMBALANCE PROBLEM AND CONTINUED CARE OF PERIPHERAL NEUROPATHY BILATERALLY. THE PT REPORTS THAT HE IS HAPPY WITH HIS SHOES; HOWEVER, HE STILL HAS SHOOTING PAINS IN THE NEUROPATHY WHICH ARE OF A LESSENING DEGREE DUE TO THE NEW SHOES. THE PT CONTINUES USING CANE FOR SUPPORT AND IS DOING PHYSICAL THERAPY. PLAN: CONTINUE PT DOING PHYSICAL THERAPY THREE TIMES A WEEK FOR 4-6 WEEKS. ON (B)(6) 2010, THE PT PRESENTED IN THE PHYSICIAN'S OFFICE FOR HIS F/U NEUROLOGICAL EVAL WITH CHIEF COMPLAINT OF NUMBNESS AND TINGLING IN BOTH FEET AND BOTH HANDS. CONDITION IS SOMEWHAT IMPROVED WITH PHYSICAL THERAPY WITH GAIT MORE STEADY. HE IS EXPERIENCING INTERMITTENT NUMBNESS AND TINGLING IN BOTH FEET AND ALSO STARTED HAVING NUMBNESS AND TINGLING IN BOTH HANDS. PT IS ATTENDING PHYSICAL THERAPY 2-3 TIMES PER WEEK WITH MODERATE RELIEF OF HIS SYMPTOMS. NEUROLOGICAL EXAMINATION: MUSCLE STRENGTH EVAL FOR MOTOR DISTRIBUTION REVEALED MUSCLES TESTING ABNORMAL (FOOT EVERSION (S1), FOOT INVERSION (L4), EXTENSOR HALLUCIS LONGUS, HAMSTRINGS, TIBIALIS ANTERIOR). DEEP TENDON REFLEXES ABNORMAL (ACHILLES, HAMSTRINGS AND PATELLAR REFLEXES). ALL SENSORY DERMATOMES NORMAL TO LIGHT TOUCH AND PINPRICK EXCEPT FOR HYPOESTHESIA IN A HIGH STOCKING DISTRIBUTION IN BOTH LOWER EXTREMITIES AND DECREASED VIBRATORY SENSATION IN THE DISTAL PART OF BOTH FEET. GAIT IS ATAXIC AND UNSTEADY. ROMBERG IS MILDLY POSITIVE. PLAN: EMG AND NERVE CONDUCTION STUDY RECOMMENDED FOR UPPER EXTREMITIES AS WELL AS CONTINUED PHYSICAL THERAPY. PRESCRIPTION OF LYRICA 50MG TO BE TAKEN TWICE A DAY FOR NEUROPATHIC PAIN AND PARESTHESIAS WAS GIVEN TO THE PT. ON (B)(6) 2010, UPPER EMG AND NERVE CONDUCTION STUDY CONDUCTED TO RULE OUT CARPAL TUNNEL SYNDROME OR ULNAR NEUROPATHY. CHIEF COMPLAINT: PT PRESENTS WITH NUMBNESS, TINGLING AND WEAKNESS IN BOTH HANDS AND SYMPTOMS HAVE BEEN PRESENT FOR A FEW YEARS AND HAVE BEEN PROGRESSING FOR 3 MONTHS. FINDINGS: ABNORMAL. IMPRESSIONS: THERE IS ELECTROPHYSIOLOGICAL EVIDENCE OF A MODERATE BILATERAL SENSORIMOTOR DEMYELINATING AND AXONAL MEDIAN NERVE NEUROPATHY AT THE WRIST CONSISTENT WITH THE CLINICAL DIAGNOSIS OF BILATERAL CARPAL TUNNEL SYNDROME. THERE IS ELECTROPHYSIOLOGICAL EVIDENCE OF A MILD LEFT SENSORIMOTOR AXONAL ULNAR NERVE NEUROPATHY AT THE WRIST. THERE IS ELECTROPHYSIOLOGIC EVIDENCE OF A DIFFUSE MODERATE SENSORIMOTOR AXONAL AND DEMYELICATING POLYNEUROPATHY. ON (B)(6) 2010, THE PT PRESENTED WITH THE DOCTOR OF INTERNAL MEDICINE FOR F/U VISIT WITH CHIEF COMPLAINT OF NUMBNESS AND TINGLING OF THE FEET AND TO THE LESSER DEGREE OF THE HAND AND UNSTEADY GAIT AND IMBALANCE. THE PT HAS A HISTORY OF DIABETES WITH NEUROPATHY AS WELL AS ZINC TOXICITY AND CENTRAL AND PERIPHERAL VESTIBULAR DYSFUNCTION. NEUROLOGICAL EXAMINATION: MUSCLE STRENGTH EVAL FOR MOTOR DISTRIBUTION REVEALED MUSCLES TESTING ABNORMAL (FOOT EVERSION (S1), FOOT INVERSION (L4), EXTENSOR HALLUCIS LONGUS, HAMSTRINGS, TIBIALIS ANTERIOR). DEEP TENDON REFLEXES ABNORMAL (BICEPS. TRICEPS. BRACHIORADIALIS, ACHILLES, HAMSTRINGS AND PATELLAR REFLEXES). SENSATION IS DIMINISHED IN A GLOVE AND STOCKING DISTRIBUTION BILATERALLY. THERE IS ALSO A DIMINISHED VIBRATORY SENSATION IN THE LOWER EXTREMITIES DISTALLY. GAIT IS ATAXIC AND UNSTEADY. THE PT AMBULATES WITH A CANE. ASSESSMENT: SEVERE PERIPHERAL POLYNEUROPATHY ASSOCIATED WITH DIABETES AND ZINC TOXICITY, CENTRAL AND PERIPHERAL VESTIBULAR DYSFUNCTION AND UNSTEADY GAIT. PLAN: CONTINUE PHYSICAL THERAPY AND ANODYNE THERAPY. F/U WITH NEUROLOGIST AS SCHEDULED. ON (B)(6) 2010, NYC CITY DISABILITY PARKING PERMIT COMPLETED BY PHYSICIAN DESCRIBED MOBILITY IMPAIRMENT AS PT SUFFERING FROM DIFFUSE SEVERE PERIPHERAL POLYNEUROPATHY WITH UNSTEADY GAIT. THE CONDITION AFFECTING HIS ABILITY TO WALK AS FOLLOWS: THE PT IS UNABLE TO WALK WITH RISK OF FALLING DOWN (LESS THAN ONE BLOCK). DISABILITY PERMANENT."
        },
        {
            "mdr_report_key": "2396504",
            "mdr_text_key": "2328962",
            "text_type_code": "D",
            "patient_sequence_number": "1",
            "date_report": null,
            "foi_text": "BAXTER (B)(4) RECEIVED A REPORT THAT A 0.5 ML/HR INFUSOR OVERINFUSED DURING PATIENT USE. THE TOTAL FILL VOLUME OF 53 ML WAS INFUSED OVER THE COURSE OF 49.5 HOURS RATHER THAN 106 HOURS. THIS IMPLIES A 1.07 ML/HR FLOW RATE, WHICH IS 214% OF THE EXPECTED FLOW RATE. THE DEVICE WAS FILLED WITH A SOLUTION OF 8 ML OF MORPHINE HYDROCHLORIDE AND 45 ML OF SALINE. INFUSION FLOW RATE GREATER THAN 130% OF EXPECTED RATE HAS THE POTENTIAL TO LEAD TO A SERIOUS INJURY. THERE WAS PATIENT INVOLVEMENT, BUT THERE WAS NO REPORT OF PATIENT INJURY, MEDICAL INTERVENTION NECESSARY, OR ADVERSE REACTION IN ASSOCIATION WITH THIS EVENT. NO ADDITIONAL INFORMATION IS AVAILABLE."
        }
    ]
}