{
    "table_name": "foitextthru1995",
    "structure": [
        {
            "name": "mdr_report_key",
            "type": "TEXT",
            "nullable": true,
            "default": null
        },
        {
            "name": "mdr_text_key",
            "type": "TEXT",
            "nullable": true,
            "default": null
        },
        {
            "name": "text_type_code",
            "type": "TEXT",
            "nullable": true,
            "default": null
        },
        {
            "name": "patient_sequence_number",
            "type": "TEXT",
            "nullable": true,
            "default": null
        },
        {
            "name": "date_report",
            "type": "TEXT",
            "nullable": true,
            "default": null
        },
        {
            "name": "foi_text",
            "type": "TEXT",
            "nullable": true,
            "default": null
        }
    ],
    "sample_data": [
        {
            "mdr_report_key": "17",
            "mdr_text_key": "34",
            "text_type_code": "D",
            "patient_sequence_number": "1",
            "date_report": null,
            "foi_text": "MALFUNCTION IN FEEDING TUBE RESULTED IN NUTRITIONAL LIQUID INFUSING TOO QUICKLY.  AS A RESULT, THE PATIENT ASPIRATED AND THE PATIENT'S CONDITION WORSENED CAUSING THE PATIENT TO BE MOVED FROM ACUTE CARE TO INTENSIVE CAREDEVICE NOT LABELED FOR SINGLE USE.  PATIENT MEDICAL STATUS PRIOR TO EVENT:  FAIR CONDITION.  THERE WAS NOT MULTIPLE PATIENT INVOLVEMENT.DEVICE SERVICED IN ACCORDANCE WITH SERVICE SCHEDULE.  DATE LAST SERVICED:  01-AUG-91.  SERVICE PROVIDED BY:  USER FACILITY BIOMEDICAL/BIOENGINEERING DEPARTMENT.  SERVICE RECORDS AVAILABLE.NO IMMINENT HAZARD TO PUBLIC HEALTH CLAIMED.  DEVICE USED AS LABELED/INTENDED.DEVICE WAS EVALUATED AFTER THE EVENT.  METHOD OF EVALUATION:  ACTUAL DEVICE INVOLVED IN INCIDENT WAS EVALUATED, PERFORMANCE TESTS PERFORMED, VISUAL EXAMINATION.  RESULTS OF EVALUATION:  MECHANICAL PROBLEM, ALARM FAILURE.  CONCLUSION:  DEVICE FAILURE OCCURRED AND WAS RELATED TO EVENT, DEVICE FAILURE RELATED TO PATIENT CONDITION, INTERMITTENT FAILURE DIRECTLY CONTRIBUTED TO EVENT, DEVICE EVALUATED AND ALLEGED FAILURE COULD NOT BE DUPLICATED.  CERTAINTY OF DEVICE AS CAUSE OF OR CONTRIBUTOR TO EVENT:  YES.  CORRECTIVE ACTIONS:  DEVICE TEMPORARILY REMOVED FROM SERVICE.  INVALID DATA - ON DEVICE DESTROYED/DISPOSED OF STATUS."
        },
        {
            "mdr_report_key": "32",
            "mdr_text_key": "18475430",
            "text_type_code": "D",
            "patient_sequence_number": "1",
            "date_report": null,
            "foi_text": "MEDTRONIC PACEMAKER EXPLANTED 2/25/92 DUE TO PATIENT HAVING DEVELOPED PACEMAKER SYNDROME.  ADDITIONAL LEAD (ATRIAL) INSERTED AND DUAL CHAMBER BIOTRONIK PACEMAKER IMPLANTED.  PATIENT BENEFITED BY HAVING INCREASED CARDIAC OUTPUT.DEVICE LABELED FOR SINGLE USE.  PATIENT MEDICAL STATUS PRIOR TO EVENT:  UNKNOWN.  THERE WAS NOT MULTIPLE PATIENT INVOLVEMENT.INVALID DATA - ON DEVICE SERVICE/MAINTENANCE.  NO DATA - REGARDING DATE LAST SERVICED.  SERVICE PROVIDED BY:  INVALID DATA.  INVALID DATA - SERVICE RECORDS AVAILABILITY.  NO IMMINENT HAZARD TO PUBLIC HEALTH CLAIMED.  DEVICE USED AS LABELED/INTENDED.DEVICE WAS NOT EVALUATED AFTER THE EVENT.  METHOD OF EVALUATION:  NO DATA.  RESULTS OF EVALUATION:  NO DATA.  CONCLUSION:  NO DATA.  CERTAINTY OF DEVICE AS CAUSE OF OR CONTRIBUTOR TO EVENT:  MAYBE.  CORRECTIVE ACTIONS:  INVALID DATA.  INVALID DATA - ON DEVICE DESTROYED/DISPOSED OF STATUS."
        },
        {
            "mdr_report_key": "48",
            "mdr_text_key": "15378750",
            "text_type_code": "D",
            "patient_sequence_number": "1",
            "date_report": null,
            "foi_text": "IV PUMP DOES NOT INFUSE FLUIDS - KEEPS \"BLANKING\" OUT.DEVICE NOT LABELED FOR SINGLE USE.  PATIENT MEDICAL STATUS PRIOR TO EVENT:  UNKNOWN.  THERE WAS NOT MULTIPLE PATIENT INVOLVEMENT.DEVICE SERVICED IN ACCORDANCE WITH SERVICE SCHEDULE.  DATE LAST SERVICED:  .  SERVICE PROVIDED BY:  USER FACILITY BIOMEDICAL/BIOENGINEERING DEPARTMENT.  SERVICE RECORDS NOT AVAILABLE.NO IMMINENT HAZARD TO PUBLIC HEALTH CLAIMED.  DEVICE USED AS LABELED/INTENDED.DEVICE WAS EVALUATED AFTER THE EVENT.  METHOD OF EVALUATION:  ACTUAL DEVICE INVOLVED IN INCIDENT WAS EVALUATED, OTHER.  RESULTS OF EVALUATION:  NONE OR UNKNOWN, INVALID DATA.  CONCLUSION:  OTHER.  CERTAINTY OF DEVICE AS CAUSE OF OR CONTRIBUTOR TO EVENT:  MAYBE.  CORRECTIVE ACTIONS:  NO DATA.  INVALID DATA - ON DEVICE DESTROYED/DISPOSED OF STATUS."
        }
    ]
}