{
    "table_name": "foitext1997",
    "structure": [
        {
            "name": "mdr_report_key",
            "type": "TEXT",
            "nullable": true,
            "default": null
        },
        {
            "name": "mdr_text_key",
            "type": "TEXT",
            "nullable": true,
            "default": null
        },
        {
            "name": "text_type_code",
            "type": "TEXT",
            "nullable": true,
            "default": null
        },
        {
            "name": "patient_sequence_number",
            "type": "TEXT",
            "nullable": true,
            "default": null
        },
        {
            "name": "date_report",
            "type": "TEXT",
            "nullable": true,
            "default": null
        },
        {
            "name": "foi_text",
            "type": "TEXT",
            "nullable": true,
            "default": null
        }
    ],
    "sample_data": [
        {
            "mdr_report_key": "58979",
            "mdr_text_key": "36586",
            "text_type_code": "D",
            "patient_sequence_number": "1",
            "date_report": null,
            "foi_text": "A PT REPORTED RECEIVING A TREATMENT ON 10/28/96 IN THE ORAL COMMISSURES, GLABELLA, AND ONE VERTICAL LINE ABOVE THE UPPER LIP. ON 11/20/96, THE PT DEVELOPED SWELLING AND REDNESS AT THE RIRGHT ORAL COMMISSURE TREATMENT SITE. ON APPROX 11/26/96, THE PT NOTES SWELLING AT THE LEFT ORAL COMMISURE TREATMENT SITE. ON 12/1/96, SHE ALLEGED DEVELOPMENT AT THE GLABELLAR TREATMENT SITE OF PAIN, ITCHING, AND SWELLING WHICH EXTENDED TOWARD THE RIGHT SIDE OF THE BRIDGE OF THE NOSE. ON 12/6/96, THE REDNESS AT THE RIGHT ORAL COMMISSURE TREATMENT SITE RESOLVED. ON 12/11/96, THE PT REPORTED CONTINUING SYMPTOMS TO THE PHYSICIAN WHO DIAGNOSED A HYPERSENSITIVITY; ORAL BENADRYL WAS PRESCRIBED. ON 12/15/96, A CONSULTING PHYSICIAN PRESCRIBED ORAL MEDROL."
        },
        {
            "mdr_report_key": "59002",
            "mdr_text_key": "36380",
            "text_type_code": "D",
            "patient_sequence_number": "1",
            "date_report": null,
            "foi_text": "BODILY INJURY FROM FAILED MEDICAL DEVICE, IMPLANTED 7/90; BLEEDING FOR TWO WEEKS AFTER IMPLANTATION, DR SAID \"EVERYTHING DEVELOPED LESION ADJACENT TO IMPLANT 11/91\"; RESTORATIVE DENTIST TREATED WITH ANTIBIOTICS FOR ONE YEAR; RESTORATIVE DENTIST (B) TREATED WITH MYCELEX FOR TWO WEEKS; RPTR BECAME ASYSTEMATICALLY ILL SOUGHT PATHOLOGIST, PUNCH BIOPSY 11/92; SECOND BIOPSY 112/20/92; REFERRED TO DDS FOR REMOVAL 11/22/92, PATHOLOGY REPORT: REMOVAL HAS CREATED SUBSTANTIAL BONE LOSS AND SCARRING. RPTR CLAIMS TO HAVE BEEN INJURED BY MFR WITH MEDICAL DEVICES THAT WERE ALL INSERTED WITHOUT HER INFORMED CONSENT. SHE FEELS SHE HAS BEEN USED AS A GUINEA PIG WITH FEDERAL RESEARCH AND EDUCATIONAL GRANTS AND SHE NEEDS SURGICAL TREATMENT FOR THE MULTIPLE INJURIES SHE HAS RECEIVED FROM THE EXPERIMENTS WITH THE INVESTIGATIONAL DEVICES AND PRODUCTS. SHE HS SPENT APPROX $53,000 ON HER JAWS FROM THE PRODUCTS AND INJURIES. PER RPTR THE MFR HAS REFUSED TO ABIDE BY GMP REQUIREMENTS AND HAS FOUGHT HER WITH A STAFF OF SIX ATTYS FOR YEARS. HER HEALTH IS DETERIORATING FROM LACK OF MEDICAL TREATMENT TO ATTEMPT TO CORRECT HER INJURIES FROM THE EXPERIMENTS. IT IS HER UNDERSTANDING THAT SHE SHOULD BE SENT TO A MEDICAL DR TO RECEIVE THE TREATMENT SHE NEEDS UNDER THE TERMS OF THE FEDERAL RESEARCH AND EDUCATION GRANTS."
        },
        {
            "mdr_report_key": "59004",
            "mdr_text_key": "38838",
            "text_type_code": "D",
            "patient_sequence_number": "1",
            "date_report": null,
            "foi_text": "THE DEVICE WAS USED DURING LAPAROSCOPIC ASSISTED VAGINAL. DURING THE BURCH PORTION OF THE PROCEDURE, THE EMS JAMMED AFTER FIRING APPROX FOUR STAPLES INTO THE PERIVAGINAL TISSUE. A SECOND EMS WAS INTRODUCED TO COMPLETE THE PROCEDURE. THERE WAS NO CONSEQUENCE TO THE PT. 11/13/96 1550 DR CONFIRMED THE INFORMATION AS REPORTED BY THE SALES REP. HE STATED AFTER THE FIRST FEW FIRINGS THE STAPLES WERE COMING OUT CROOKED AND WERE NOT FOLDING INTO THE TISSUE THE RIGHT WAY. A NEW INSTRUMENT WAS OPENED TO COMPLETE THE CASE. DR SAID HE HAD TO GO BACK AND RE-STAPLE EVEN THE FIRST FEW SATPLES FIRED."
        }
    ]
}